# 1.3 整数

## 1.3.1 2項演算子

a = 11
b = 7

### 加算：#{a} + #{b} = #{a + b}
puts a + b

### 乗算：#{a} * #{b} = #{a * b}
puts a * b

### 減算：#{a} - #{b} = #{a - b}
puts a - b

### 乗算：#{a} / #{b} = #{a / b}
puts a / b

### 累乗：#{a} ** #{b} = #{a ** b}
puts a ** b

## 1.3.2 論理演算子

### 大小比較：#{a} < #{b} -> #{a < b}
pp a < b

### 大小比較：#{a} > #{b} -> #{a < b}
pp a > b

### 等しい：#{a} == #{b} -> #{a == b}
pp a == b

### 等しくない：#{a} != #{b} -> #{a != b}
pp a != b

## 1.3.3 メソッド：絶対値
puts (a - b).abs

## 1.3.4 繰り返し
3.times { puts "hi" }

## 1.3.5 代入演算子

### a = 10
a = 10
puts a

### a += 5
a += 5
puts a

### a -= 5
a -= 5
puts a

### a *= 5
a *= 5
puts a